------------------------------------РЕГИСТРАЦИЯ--------------------------------
DO $$
DECLARE
    user_id_param INT;
    user_exists BOOLEAN;
BEGIN
    CALL add_user('Qwerty', 'Qwerty12345', 'users', 'C:\3course\COURSE_PROJ\online_music\Photos\storedPlaylist.jpg', user_id_param, user_exists);
END;
$$;

------------------------------------АВТОРИЗАЦИЯ--------------------------------
DO $$
DECLARE
    is_valid_user BOOLEAN;
    user_role VARCHAR(255);
    user_id INT;
BEGIN
    CALL login('Qwerty', 'Qwerty12345', is_valid_user, user_role, user_id);
END;
$$;

----------------------------------ИЗМЕНЕНИЕ(ПОЛЬЗОВАТЕЛЬ)------------------------------------
call edit_user_info(100020, 'qwerty', 'Qwerty12345');

----------------------------------УДАЛЕНИЕ(ПОЛЬЗОВАТЕЛЬ)------------------------------------
call delete_user('qwerty')




----------------------------------ДОБАВЛЕНИЕ ИСПОЛНИТЕЛЯ-------------------------------------
CALL insert_artist('qwerty',
    '\x89504E470D0A1A0A00000000D494844520000002800000028080600000090CE3F000000017352474200AECE1CE90000000467414D410000B18F0BFC6105000000097048597300000EC400000EC40195A28E9F0000001A4944415478DAED9D0B780C00021F0C7000000000049454E44AE426082',
    '2010.2.13',
    'qwerty',
    'qwerty',
    12345
);
select * from artists


---------------------------------УДАЛЕНИЕ АРТИСТА--------------------------------------------
CALL delete_artist_by_name('qwerty');


---------------------------------ДОБАВЛЕНИЕ ПЕСНИ--------------------------------------------
CALL add_song_and_link_artists('Кайфик', 'C:\3course\COURSE_PROJ\online_music\Music\Макс Корж - Жить В Кайф.mp3', 'C:\3course\COURSE_PROJ\online_music\Photos\МаксКорж.jpg', ARRAY['qwerty']);


---------------------------------ИЗМЕНЕНИЕ ПЕСНИ---------------------------------------------
CALL updatesongandartistsbyid(
    51,
    'C:\3course\COURSE_PROJ\online_music\Music\Макс Корж - Жить В Кайф.mp3',
    'C:\3course\COURSE_PROJ\online_music\Photos\МаксКорж.jpg',
    ARRAY['qwerty']
);


--------------------------------УДАЛЕНИЕ ПЕСНИ----------------------------------------------
CALL delete_song_and_unlink_artists('Кайфик',  ARRAY['qwerty')




--------------------------------ДОБАВЛЕНИЕ В ИЗББРАННОЕ---------------------------------------
CALL add_song_to_favorites(100020, 50);

--------------------------------УДАЛЕНИЕ ИЗ ИЗБРАННОГО---------------------------------------
CALL RemoveSongFromPlaylist(100020, 'Понравившиеся', 50);



--------------------------------СОЗДАНИЕ ПЛЕЙЛИСТА---------------------------------------
CALL create_playlist(100020, 'Спорт', 'Для занятий спортом','C:\3course\COURSE_PROJ\online_music\Photos\10.jpg')

--------------------------------ИЗМЕНЕНИЕ ПЛЕЙЛИСТА--------------------------------------
CALL edit_playlist(100020, 'Спорт', 'Танцы','для танцев','C:\3course\COURSE_PROJ\online_music\Photos\10.jpg')

--------------------------------ДОБАВЛЕНИЕ ПЕСНИ В ПЛЕЙЛИСТ--------------------------------------
CALL add_song_to_playlist(100020, 'Танцы', 45)

--------------------------------УДАЛЕНИЕ ПЛЕЙЛИСТА--------------------------------------
DO $$
BEGIN
    PERFORM delete_playlist(100020, 'Танцы');
EXCEPTION
    WHEN OTHERS THEN
        RAISE NOTICE 'Ошибка: %', SQLERRM;
END $$;



--------------------------------СОЗДАНИЕ СООБЩЕСТВА--------------------------------------
CALL create_genre_community('Новое', 'Хип-Хоп', 'Описание сообщества', 'C:\3course\COURSE_PROJ\online_music\Photos\Honeymoon.jpg');

--------------------------------ВСТУПИТЬ В СООБЩЕСТВО------------------------------------
CALL join_community(100019, 'Новое')

--------------------------------ВЫХОД ИЗ СООБЩЕСТВА------------------------------------
CALL remove_user_from_community('Новое',100019)

--------------------------------УДАЛЕНИЕ СООБЩЕСТВА------------------------------------
CALL delete_community('Новое')





--------------------------------ФИЛЬТРАЦИЯ ПО ПРОСЛУШИВАНИЯМ--------------------------------------
select from get_songs_by_listens_count_range(0, 1, 0,5)


--------------------------------ПОИСК ПО НАЗВАНИЮ--------------------------------------
select from SearchSongsByTitle('w', 0, 0)


--------------------------------ПОИСК ПО АРТИСТУ--------------------------------------
select from SearchSongsByTitle('w', 0, 0)






